doc/background.org
* File Configuration                                       :ARCHIVE:noexport:
#+TITLE: Ridehail simulation
#+AUTHOR: Tom Slee
#+LATEX_CLASS: article
#+OPTIONS: H:3 toc:t num:t ':t arch:nil d:nil prop:nil tags:nil todo:nil
#+STARTUP: content indent beamer noalign inlineimages latexpreview
#+STARTUP: logdone logdrawer hideblocks  hidestars hideblocks
#+TODO: TODO(t) PROJ(p) NEXT WAIT(w@/!) | DONE(d@) CANCELLED(c@)
# #+SETUPFILE: ~/prodmgmt/org/org-html-themes/setup/bigblow-pirilampo.setup


* Inspiration

This project was inspired by a New York Times animation with this title, published on April 2, 2017. The animation was a simple simulation of a ridehail system for exploring how wait times and driver efficiency (fraction busy) are related.

The NYT animation is [[https://www.nytimes.com/interactive/2017/04/02/technology/uber-drivers-psychological-tricks.html][here]], but in case the link is broken I captured the video [[file:output/nyt_ridehail.mp4][here]]. It shows a 9 * 40 grid city with around 50 requests at the beginning. The number of drivers can be chosen from 50, 75, 125, or 250. The wait time and percent of drivers idling goes as follows:

| Drivers | Wait time (mins) | Drivers idle (%) |
|---------+------------------+------------------|
|      50 |               18 |                2 |
|      75 |               12 |                5 |
|     125 |                5 |               50 |
|     250 |                3 |               71 |

Idle time does not include time heading to pick up the passenger. At the end of each trip the riders vanish and the drivers stay still.

There is also a rider at the top of the bottom-left block, who vanishes.

A rider in the very bottom left edge gets picked up after three seconds, and it taken all the way to the top, along to the right edge, and back down to the bottom right corner before being dropped off.

At the beginning of the simulation there is a rider in the top left corner. Not picked up after several seconds, the rider just vanishes.

In reply, Uber, [[https://www.uber.com/newsroom/faster-pickup-times-mean-busier-drivers/][here]], argues that "This is simply not true... When Uber grows in a city: riders enjoy lower pick-up times /and/ drivers benefit from less downtime between trips. It's a virtuous cycle that is widely acknowledged in [[https://twitter.com/davidsacks/status/475073311383105536?lang=en][business]] and [[https://www.nber.org/papers/w22083][academia]], and which is backed up by data."

The "business" link is to a tweet with a napkin sketch. The "academia" link is to Cramer and Kruger, of which more below. The links are accompanied by charts---with no y axis labels---showing that in major cities the driver idle time (median percent of time not with a rider) has shrunk, along with ETA (wait time), in five major US cities from June 2014 to June 2015 to June 2016 as the number of drivers has grown.

This is a comparisons of apples to oranges, and the lack of a Y axis scale makes the Uber claims dubious, but it still suggests something worth investigating.

Here is the rest of Uber's explanation:

#+begin_quote
How is this happening? First, as the number of passengers and drivers using Uber grows, any individual driver is more likely to be close to a rider. This means shorter pickup times and more time spent with a paying passenger in the back of the car. In addition, new features like uberPOOL and Back-to-Back trips have meant longer trips, while incentives to drive during the busiest times and in the busiest locations help keep drivers earning for a greater share of their time online. And that should be no surprise: drivers are our customers just as much as riders. So although the Times article suggests that Uber’s interest is misaligned with drivers’, the opposite is true: it’s in our interest to ensure that drivers have a paying passenger as often as possible because they’re more likely to keep using our app to earn money. (And Uber doesn’t earn money until drivers do.)
#+end_quote

* Capacity utilization: city reports

Deadheading refers to the time or distance without a rider in the car. If a driver waits where they are between rides, these two measures may be quite different.

** Driver phases

Ride-hail insurance commonly uses these phases
- Phase 0: App is off. Your personal policy covers you.
- Phase 1: App is on, you're waiting for ride request. 
- Phase 2: Request accepted, and you're en route to pick up a passenger.
- Phase 3: You have passengers in the car.

** Schaller, The New Automobility

From Bruce Schaller (/The New Automobility/) [[http://www.schallerconsult.com/rideservices/automobility.pdf][here]].

#+begin_quote
Working against the efficiency of Uber and Lyft is the large proportion of mileage without a paying passenger in the vehicle. For a typical passenger trip of 5.2 miles, a TNC driver travels three miles waiting to get pinged and then going to pick up the fare.
#+end_quote

This corresponds to a P3 fraction of about 65% by distance.

Here is a table, modified from Schaller:

Table 7. Passenger miles and total miles for TNC trips

| City          | P3 | P2 | P1 | <trip> (driver-miles) |
|---------------+----+----+----+-----------------------|
| New York City | 59 | 08 | 33 |                   8.6 |
| Chicago       | 59 | 10 | 31 |                   7.9 |
| San Francisco | 67 | 10 | 23 |                   6.1 |
| Denver        | 71 | 14 | 15 |                   9.9 |

Sources: Carolyn Said, “Lyft trips in San Francisco more efficient than
personal cars, study finds,” San Francisco Chronicle, January 5, 2018;
Alejandro Henao, “Impacts of Ridesourcing–Lyft and Uber –on Transportation
including VMT, Mode Replacement, Parking, and Travel Behavior,” Doctoral
Dissertation Defense, January 2017; and author’s analysis of NYC Taxi and
Limousine Commission TNC trip data. Mileage with passenger of 63% is
consistent with statewide California average of 61%; see Simi Rose George
and Marzia Zafar, “Electrifying the Ride-Sourcing Sector in California,”
California Public Utilities Commission, April 2018.

Schaller from Empty Seats, Full Streets:

#+begin_quote
In 2017 TNCs had 55K hours with passengers in the Manhattan Central Business District (CBD), and 37K hours without passengers (60% busy).

While yellow cabs were occupied with passengers 67 percent of the time in 2013, the utilization rate for combined taxi/TNC operations dropped to 62 percent in 2017.
#+end_quote

** John Barrios

> “Rideshare companies often subsidize drivers to stay on the road even when utilization is low, to ensure that supply is quickly available,” they wrote.

