doc/background.org
** Cramer and Krueger

In [[https://www.nber.org/papers/w22083.pdf][Disruptive Change in the Taxi Business: The Case of Uber]], Cramer and Krueger write:

#+begin_quote
Capacity utilization is measured either by the fraction of time that drivers have a farepaying passenger in the car or by the fraction of miles that drivers log in which a passenger is in the car. Because we are only able to obtain estimates of capacity utilization for taxis for a handful of major cities – Boston, Los Angeles, New York, San Francisco and Seattle – our estimates should be viewed as suggestive. Nonetheless, the results indicate that UberX drivers, on average, have a passenger in the car about half the time that they have their app turned on, and this average varies relatively little across cities, probably due to relatively elastic labor supply given the ease of entry and exit of Uber drivers at various times of the day. In contrast, taxi drivers have a passenger in the car an average of anywhere from 30 percent to 50 percent of the time they are working, depending on the city. Our results also point to higher productivity for UberX drivers than taxi drivers when the share of miles driven with a passenger in the car is used to measure capacity utilization. On average, the capacity utilization rate is 30 percent higher for UberX drivers than taxi drivers when measured by time, and 50 percent higher when measured by miles, although taxi data are not available to calculate both measures for the same set of cities.

Four factors likely contribute to the higher utilization rate of UberX drivers: 1) Uber’s more efficient driver-passenger matching technology; 2) Uber’s larger scale, which supports faster matches; 3) inefficient taxi regulations; and 4) Uber’s flexible labor supply model and surge pricing, which more closely match supply with demand throughout the day.
#+end_quote

They report these capacity utilizations (% of hours with a passenger).

| City    | TNC | Taxi | TNC Distance | Taxi Distance |
|---------+-----+------+--------------+---------------|
| Boston  | 47% | NA   |              |               |
| LA      | 52% | NA   |          64% |           41% |
| NYC     | 51% | 48%  |              |               |
| SF      | 55% | 38%  |              |               |
| Seattle | 44% | NA   |          55% |           39% |

Also, for LA and Seattle, they report capacity utilization rates by distance (percent of miles driven with a passenger). These have been added in above. The higher distance values show that some drivers may stay still when waiting for a ride.

** TNCs Today: SFCTA report (2017)

The report is [[https://archive.sfcta.org/sites/default/files/content/Planning/TNCs/TNCs_Today_112917.pdf][here]]. In the report, "In-service VMT refers to the vehicle miles traveled when transporting a passenger. Out-of-service VMT [vehicle miles travelled] refers to the vehicle miles traveled while circulating to pickup a passenger." It is not clear if this includes P3 time and distance.

#+begin_quote
Approximately 20% of total TNC VMT are out-of-service miles. This is significantly lower than the more than 40% of taxi VMT that are out-of-service miles... The greater efficiencies of TNCs, as
reflected in a lower share of out-of-service miles, are likely
primarily a reflection of the larger fleets of TNC drivers operating on the road at any given time, enabling shorter distances to pickup locations. 
#+end_quote

Table 4 (weekdays) is similar to tables 5 and 6 (weekends).

| Quantity                           | TNC       | Taxi       |
|------------------------------------+-----------+------------|
| Trips                              | 170K      | 14K        |
| Average trip length                | 3.3 miles | 4.6 miles  |
| Average in-service trip length     | 2.6 miles | 2.6 miles  |
| Average out-of-service trip length | 0.7 miles | 2.0 miles  |
| Percent out-of-service trip length | 21%       | 44%        |

The data used in this study was collected from the Uber API. "Sending a request to the API returns a text file response containing this information [nearby vehicle locations, estimated times-to-pickup, and more]. I am sceptical of the data here.

** Alejandro Henao, University of Colorado at Denver, Master's Thesis (2013)

Based on his own experience.

| Phase                    | Time (minutes) |
|--------------------------+----------------|
| Available                |             12 |
| Pickup                   |              6 |
| Wait for pax             |              1 |
| Ride                     |             15 |
| Going home at end of day |             22 |

| Phase                    | Distance (miles) |
|--------------------------+------------------|
| Available                |              1.5 |
| Pickup                   |              1.5 |
| Trip                     |                7 |
| Going home at end of day |               12 |

#+begin_quote
The time efficiency rate of a ridesourcing driver based on the time a passenger is in the car and total time from driver log-in to log-out (not accounting for the commute at the end of the shift) is 41.3%, meaning that I, as a driver, during my shift hours spent more time without a passenger than with one in the car... When accounting for commuting time at end of shift, the time efficiency rate drops to 39.3% of total time... Lyft and Uber drivers travel an additional 69.0 miles in deadheading for every 100 miles they are with passengers.
#+end_quote

** Uber blog

This Uber blog post from 2015 is about [[https://www.uber.com/en-GB/blog/london/how-efficiency-benefits-riders-and-partners/][efficiency]].

#+begin_quote
Since uberX launched in London in July 2013, average pick-up times – the time between requesting and your car arriving – have reduced from 6 and a half minutes to just over 3 minutes.

| Year | pick-up time (minutes) | P3 % by time |
|------+------------------------+--------------|
| 2013 |                    6.3 |           17 |
| 2014 |                    4.3 |              |
| 2015 |                    3.1 |           57 |

Back in 2013, when uberX launched in London, partners had a passenger in their car for 16 minutes of every hour. Now that number has more than doubled to 34 minutes.
#+end_quote

