doc/background.org
** Fehr & Peers in Boston (2019)

See [[https://mass.streetsblog.org/2019/08/08/uberlyft-admit-responsibility-for-a-significant-share-of-bostons-traffic/][Streetsblog]] report or the full report by Fehr and Peers [[https://drive.google.com/file/d/1FIUskVkj9lsAnWJQ6kLhAhNoVLjfFdx3/view][here]]. The study was jointly commissioned by Uber and Lyft

"In the 4-county Boston metropolitan region (which encompasses Suffolk, Norfolk, Middlesex and Essex counties), Uber and Lyft drivers drove between 20 million and 26 million miles without any passengers in the month of September 2018 – nearly as much driving as they did with passengers."

Reminder: P1 = idle; P2 = picking up; P3  with passenger.

Table 3 of the report. TNC Vehicle Miles Traveled (VMT), in millions. The Total and percentage columns use the mid-point.

Note that P3 values *by time* (as opposed to by distance) may be lower. During P1 time drivers may drive less quickly (if at all) and so P3 time by distance will be higher.

| Region        | P1 (low) | P1 (High) | P1 (Mid) |   P2 |    P3 | Total | P3 % | P2 % | P1 % |
|---------------+----------+-----------+----------+------+-------+-------+------+------+------|
| Boston        |     14.7 |      20.6 |     17.6 |  5.3 |  28.3 |  51.2 | 0.55 | 0.10 | 0.34 |
| Chicago       |     29.7 |      40.8 |     35.3 |  9.1 |  54.6 |  99.0 | 0.55 | 0.09 | 0.36 |
| Los Angeles   |     38.3 |      63.2 |     50.7 | 17.7 | 104.1 | 172.5 | 0.60 | 0.10 | 0.29 |
| San Francisco |     31.5 |      46.6 |     30.1 | 11.9 |  75.2 | 117.2 | 0.64 | 0.10 | 0.26 |
| Seattle       |      9.7 |      15.6 |     12.7 |  2.9 |  17.6 |  33.2 | 0.53 | 0.09 | 0.38 |
| Washington DC |     24.4 |      33.5 |     28.9 |  8.1 |  46.0 |  83.0 | 0.55 | 0.10 | 0.35 |
|---------------+----------+-----------+----------+------+-------+-------+------+------+------|
| Average %     |      28% |       37% |      33% |  10% |   58% |   1.0 | 0.58 | 0.10 | 0.33 |
#+TBLFM: $7=vsum($4..$6);f1::$8=$6/$7;f2::$9=$5/$7;f2::$10=$4/$7;f2

** Competing reports in Seattle

In July 2020 two reports on ride-hailing in Seattle were released.
- [[https://digitalcommons.ilr.cornell.edu/cgi/viewcontent.cgi?article=1070&context=reports][Platform Driving in Seattle]] by Louis Hyman, Erica L. Groshen, Adam Seth Litwin, Martin T. Wells and Kwelina P. Thompson was a collaboration with Uber and the authors had access to detailed (ride-level) data for one week.
- [[https://irle.berkeley.edu/files/2020/07/Parrott-Reich-Seattle-Report_July-2020.pdf][A Minimum Compensation Standard for Seattle TNC Drivers]] by James A. Parrott and Michael Reich was commissioned by the City of Seattle.

While they disagree on many things, the picture they paint of capacity utilization is not that different.

Here is Hyman et al. (adapted from Chart 1.7, p 35): median weekly hours by period by driver type:

| Driver Type      |  P3 |  P2 |  P1 |
|------------------+-----+-----+-----|
| Full-time        | 57% | 14% | 30% |
| Part-time        | 56% | 15% | 30% |
| Committed Casual | 60% | 10% | 30% |
| Casual           |   0 |   1 | 0   |
| All              | 60% | 10% | 30% |

And here is P&R (Exhibit 30, p52):

| Data source |  P3 |  P2 |  P1 |
|-------------+-----+-----+-----|
| Uber        | 51% | 13% | 36% |
| Lyft        | 47% | 13% | 40% |

Between a third (H) and a half (P&R) of drivers use both Lyft and Uber apps. As a result, P&R may be double-counting some of the P1 time. If we say that a third of the drivers use both apps all the time, then this would lead to over-counting by 1/6, which brings the P&R figures into close agreement with LH.

