doc/background.md


<a id="org0ea72ef"></a>

## Fehr & Peers in Boston (2019)

See [Streetsblog](https://mass.streetsblog.org/2019/08/08/uberlyft-admit-responsibility-for-a-significant-share-of-bostons-traffic/) report or the full report by Fehr and Peers [here](https://drive.google.com/file/d/1FIUskVkj9lsAnWJQ6kLhAhNoVLjfFdx3/view). The study was jointly commissioned by Uber and Lyft

&ldquo;In the 4-county Boston metropolitan region (which encompasses Suffolk, Norfolk, Middlesex and Essex counties), Uber and Lyft drivers drove between 20 million and 26 million miles without any passengers in the month of September 2018 – nearly as much driving as they did with passengers.&rdquo;

Reminder: P1 = idle; P2 = picking up; P3  with passenger.

Table 3 of the report. TNC Vehicle Miles Traveled (VMT), in millions. The Total and percentage columns use the mid-point.

Note that P3 values **by time** (as opposed to by distance) may be lower. During P1 time drivers may drive less quickly (if at all) and so P3 time by distance will be higher.

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Region</th>
<th scope="col" class="org-right">P1 (low)</th>
<th scope="col" class="org-right">P1 (High)</th>
<th scope="col" class="org-right">P1 (Mid)</th>
<th scope="col" class="org-right">P2</th>
<th scope="col" class="org-right">P3</th>
<th scope="col" class="org-right">Total</th>
<th scope="col" class="org-right">P3 %</th>
<th scope="col" class="org-right">P2 %</th>
<th scope="col" class="org-right">P1 %</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left">Boston</td>
<td class="org-right">14.7</td>
<td class="org-right">20.6</td>
<td class="org-right">17.6</td>
<td class="org-right">5.3</td>
<td class="org-right">28.3</td>
<td class="org-right">51.2</td>
<td class="org-right">0.55</td>
<td class="org-right">0.10</td>
<td class="org-right">0.34</td>
</tr>


<tr>
<td class="org-left">Chicago</td>
<td class="org-right">29.7</td>
<td class="org-right">40.8</td>
<td class="org-right">35.3</td>
<td class="org-right">9.1</td>
<td class="org-right">54.6</td>
<td class="org-right">99.0</td>
<td class="org-right">0.55</td>
<td class="org-right">0.09</td>
<td class="org-right">0.36</td>
</tr>


<tr>
<td class="org-left">Los Angeles</td>
<td class="org-right">38.3</td>
<td class="org-right">63.2</td>
<td class="org-right">50.7</td>
<td class="org-right">17.7</td>
<td class="org-right">104.1</td>
<td class="org-right">172.5</td>
<td class="org-right">0.60</td>
<td class="org-right">0.10</td>
<td class="org-right">0.29</td>
</tr>


<tr>
<td class="org-left">San Francisco</td>
<td class="org-right">31.5</td>
<td class="org-right">46.6</td>
<td class="org-right">30.1</td>
<td class="org-right">11.9</td>
<td class="org-right">75.2</td>
<td class="org-right">117.2</td>
<td class="org-right">0.64</td>
<td class="org-right">0.10</td>
<td class="org-right">0.26</td>
</tr>


<tr>
<td class="org-left">Seattle</td>
<td class="org-right">9.7</td>
<td class="org-right">15.6</td>
<td class="org-right">12.7</td>
<td class="org-right">2.9</td>
<td class="org-right">17.6</td>
<td class="org-right">33.2</td>
<td class="org-right">0.53</td>
<td class="org-right">0.09</td>
<td class="org-right">0.38</td>
</tr>


<tr>
<td class="org-left">Washington DC</td>
<td class="org-right">24.4</td>
<td class="org-right">33.5</td>
<td class="org-right">28.9</td>
<td class="org-right">8.1</td>
<td class="org-right">46.0</td>
<td class="org-right">83.0</td>
<td class="org-right">0.55</td>
<td class="org-right">0.10</td>
<td class="org-right">0.35</td>
</tr>
</tbody>

<tbody>
<tr>
<td class="org-left">Average %</td>
<td class="org-right">28%</td>
<td class="org-right">37%</td>
<td class="org-right">33%</td>
<td class="org-right">10%</td>
<td class="org-right">58%</td>
<td class="org-right">1.0</td>
<td class="org-right">0.58</td>
<td class="org-right">0.10</td>
<td class="org-right">0.33</td>
</tr>
</tbody>
</table>


<a id="orgd298470"></a>

## Competing reports in Seattle

In July 2020 two reports on ride-hailing in Seattle were released.

-   [Platform Driving in Seattle](https://digitalcommons.ilr.cornell.edu/cgi/viewcontent.cgi?article=1070&context=reports) by Louis Hyman, Erica L. Groshen, Adam Seth Litwin, Martin T. Wells and Kwelina P. Thompson was a collaboration with Uber and the authors had access to detailed (ride-level) data for one week.
-   [A Minimum Compensation Standard for Seattle TNC Drivers](https://irle.berkeley.edu/files/2020/07/Parrott-Reich-Seattle-Report_July-2020.pdf) by James A. Parrott and Michael Reich was commissioned by the City of Seattle.

While they disagree on many things, the picture they paint of capacity utilization is not that different.

Here is Hyman et al. (adapted from Chart 1.7, p 35): median weekly hours by period by driver type:

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Driver Type</th>
<th scope="col" class="org-right">P3</th>
<th scope="col" class="org-right">P2</th>
<th scope="col" class="org-right">P1</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left">Full-time</td>
<td class="org-right">57%</td>
<td class="org-right">14%</td>
<td class="org-right">30%</td>
</tr>


<tr>
<td class="org-left">Part-time</td>
<td class="org-right">56%</td>
<td class="org-right">15%</td>
<td class="org-right">30%</td>
</tr>


<tr>
<td class="org-left">Committed Casual</td>
<td class="org-right">60%</td>
<td class="org-right">10%</td>
<td class="org-right">30%</td>
</tr>


<tr>
<td class="org-left">Casual</td>
<td class="org-right">0</td>
<td class="org-right">1</td>
<td class="org-right">0</td>
</tr>


<tr>
<td class="org-left">All</td>
<td class="org-right">60%</td>
<td class="org-right">10%</td>
<td class="org-right">30%</td>
</tr>
</tbody>
</table>

And here is P&R (Exhibit 30, p52):

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Data source</th>
<th scope="col" class="org-right">P3</th>
<th scope="col" class="org-right">P2</th>
<th scope="col" class="org-right">P1</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left">Uber</td>
<td class="org-right">51%</td>
<td class="org-right">13%</td>
<td class="org-right">36%</td>
</tr>


<tr>
<td class="org-left">Lyft</td>
<td class="org-right">47%</td>
<td class="org-right">13%</td>
<td class="org-right">40%</td>
</tr>
</tbody>
</table>

Between a third (H) and a half (P&R) of drivers use both Lyft and Uber apps. As a result, P&R may be double-counting some of the P1 time. If we say that a third of the drivers use both apps all the time, then this would lead to over-counting by 1/6, which brings the P&R figures into close agreement with LH.
