doc/background.org
** Summary

From several North American cities, we have approximate numbers like this:

| City          |  Year | Source           | P3 % | P2 % | P1 % | Note     |
|---------------+-------+------------------+------+------+------+----------|
| Seattle       |  2020 | Hyman            |   57 |   14 |   30 |          |
| Seattle       |  2020 | P&R*             |   55 |   15 |   30 |          |
| London        |  2015 | Uber             |   57 |      |      |          |
| London        |  2013 | Uber             |   17 |      |      |          |
| San Francisco |  2017 | SFCTA            |   79 |      |   21 | by miles |
| Boston        | 2014? | Cramer & Krueger |   47 |      |      |          |
| Los Angeles   | 2014? | Cramer & Krueger |   52 |      |      |          |
| New York City | 2014? | Cramer & Krueger |   51 |      |      |          |
| San Francisco | 2014? | Cramer & Krueger |   55 |      |      |          |
| New York City |  2018 | Schaller         |   65 |      |      | by miles |
| Manhattan CBD |  2017 | Schaller         |   60 |      |      | by miles |
| New York City |  2017 | Schaller         |   59 |   08 |   33 | by miles |
| Chicago       |  2017 | Henao            |   59 |   10 |   31 | by miles |
| San Francisco |  2017 | Said             |   67 |   10 |   23 | by miles |
| Denver        |  2017 | Henao            |   71 |   14 |   15 | by miles |

** Is my model compatible with these figures?

Some possibilities for city_size=40, request_rate=1.2. Reading off P1 30%:

| Trip Distribution | Min trip | Drivers | P3 | P2 | P1 | (Wait time) |
|-------------------+----------+---------+----+----+----+-------------|
| Uniform           |        0 |      50 | 50 | 18 | 30 |          28 |
| Uniform           |       20 |      60 | 55 | 15 | 30 |          22 |
| Beta              |        0 |      62 | 54 | 20 | 30 |          29 |
| Beta              |       20 |       - |    |    | 30 |             |

For a lower request rate, of 0.8:

| Trip Distribution | Min trip | Drivers | P3 | P2 | P1 | (Wait time) |
|-------------------+----------+---------+----+----+----+-------------|
| Uniform           |        0 |      36 | 50 | 20 | 30 |          30 |
| Uniform           |       20 |      42 | 55 | 15 | 30 |          24 |
| Beta              |        0 |      62 | 54 | 20 | 30 |          29 |
| Beta              |       20 |       - |    |    | 30 |             |

So: long trips and uniform distribution are needed for this level of capacity utilization. It's at the upper end of what is geometrically possible.

Also: for the uniform cases, the results are independent of request rate: it takes more drivers, but they end up at the same distribution. This is surprising to me.

For uniform distributions, longer trips require more drivers to reach the 30% P1 rate, but when they do so there is a higher capacity utilization and lower pick-up time. Also a lower wait time. This may be said better as: for uniform distributions, longer trips lead to higher P3 rates at a given number of drivers, higher P2 values (they have to drive further to get their next drive), and corresponding lower P1 values.

P3 percentages and number of drivers to support a steady state may both be measures of efficiency.

* Simulating Manhattan

** Grid size (50*50)

According to [[https://en.wikipedia.org/wiki/William_B._Helmreich][William Helmreich]], New York City has 120,000 blocks, and he should know because he walked them all over the course of four years, for a total of 6163 miles (about 10K kilometers).

The figure of 120,000 blocks is reported in [[https://www.newyorker.com/books/page-turner/a-walker-in-the-city][a 2013 New Yorker article]] on Helmreich.

Manhattan is much smaller: from a [[https://www.quora.com/Approximately-how-many-blocks-are-there-on-the-island-of-Manhattan][Quora question]]: 220th street is the northernmost street, and some say it's about 250 blocks north to south. Another way to think about it is that Manhattan is about 13 miles with 20 blocks to the mile (1 block ~ 100 yards). At its widest point Manhattan is 2.3 miles, but it is much narrower in other places. Someone else says 2872 blocks.

One approach is area. Manhattan is 59.1 km^2 (call it 60), or 6*10^7 m^2. That's equivalent to 23 square miles (or 13 * 1.75).

According to [[https://en.wikipedia.org/wiki/City_block][Wikipedia]]: "the standard block in Manhattan is about 264 by 900 feet (80 m × 274 m)", so call that 100 * 250m = 2.5*10^4 m^2. 

Number of blocks = (6 * 10^7)/(2.5 * 10^4) ~ 2.5 * 10^3, which is the same as a 50*50 grid.

