doc/background.md


<a id="org7854e66"></a>

## Summary

From several North American cities, we have approximate numbers like this:

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">City</th>
<th scope="col" class="org-right">Year</th>
<th scope="col" class="org-left">Source</th>
<th scope="col" class="org-right">P3 %</th>
<th scope="col" class="org-right">P2 %</th>
<th scope="col" class="org-right">P1 %</th>
<th scope="col" class="org-left">Note</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left">Seattle</td>
<td class="org-right">2020</td>
<td class="org-left">Hyman</td>
<td class="org-right">57</td>
<td class="org-right">14</td>
<td class="org-right">30</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">Seattle</td>
<td class="org-right">2020</td>
<td class="org-left">P&R\*</td>
<td class="org-right">55</td>
<td class="org-right">15</td>
<td class="org-right">30</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">London</td>
<td class="org-right">2015</td>
<td class="org-left">Uber</td>
<td class="org-right">57</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">London</td>
<td class="org-right">2013</td>
<td class="org-left">Uber</td>
<td class="org-right">17</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">San Francisco</td>
<td class="org-right">2017</td>
<td class="org-left">SFCTA</td>
<td class="org-right">79</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">21</td>
<td class="org-left">by miles</td>
</tr>


<tr>
<td class="org-left">Boston</td>
<td class="org-right">2014?</td>
<td class="org-left">Cramer & Krueger</td>
<td class="org-right">47</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">Los Angeles</td>
<td class="org-right">2014?</td>
<td class="org-left">Cramer & Krueger</td>
<td class="org-right">52</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">New York City</td>
<td class="org-right">2014?</td>
<td class="org-left">Cramer & Krueger</td>
<td class="org-right">51</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">San Francisco</td>
<td class="org-right">2014?</td>
<td class="org-left">Cramer & Krueger</td>
<td class="org-right">55</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">New York City</td>
<td class="org-right">2018</td>
<td class="org-left">Schaller</td>
<td class="org-right">65</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">by miles</td>
</tr>


<tr>
<td class="org-left">Manhattan CBD</td>
<td class="org-right">2017</td>
<td class="org-left">Schaller</td>
<td class="org-right">60</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">by miles</td>
</tr>


<tr>
<td class="org-left">New York City</td>
<td class="org-right">2017</td>
<td class="org-left">Schaller</td>
<td class="org-right">59</td>
<td class="org-right">08</td>
<td class="org-right">33</td>
<td class="org-left">by miles</td>
</tr>


<tr>
<td class="org-left">Chicago</td>
<td class="org-right">2017</td>
<td class="org-left">Henao</td>
<td class="org-right">59</td>
<td class="org-right">10</td>
<td class="org-right">31</td>
<td class="org-left">by miles</td>
</tr>


<tr>
<td class="org-left">San Francisco</td>
<td class="org-right">2017</td>
<td class="org-left">Said</td>
<td class="org-right">67</td>
<td class="org-right">10</td>
<td class="org-right">23</td>
<td class="org-left">by miles</td>
</tr>


<tr>
<td class="org-left">Denver</td>
<td class="org-right">2017</td>
<td class="org-left">Henao</td>
<td class="org-right">71</td>
<td class="org-right">14</td>
<td class="org-right">15</td>
<td class="org-left">by miles</td>
</tr>
</tbody>
</table>


<a id="orge8d547c"></a>

## Is my model compatible with these figures?

Some possibilities for city<sub>size</sub>=40, request<sub>rate</sub>=1.2. Reading off P1 30%:

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Trip Distribution</th>
<th scope="col" class="org-right">Min trip</th>
<th scope="col" class="org-right">Drivers</th>
<th scope="col" class="org-right">P3</th>
<th scope="col" class="org-right">P2</th>
<th scope="col" class="org-right">P1</th>
<th scope="col" class="org-right">(Wait time)</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left">Uniform</td>
<td class="org-right">0</td>
<td class="org-right">50</td>
<td class="org-right">50</td>
<td class="org-right">18</td>
<td class="org-right">30</td>
<td class="org-right">28</td>
</tr>


<tr>
<td class="org-left">Uniform</td>
<td class="org-right">20</td>
<td class="org-right">60</td>
<td class="org-right">55</td>
<td class="org-right">15</td>
<td class="org-right">30</td>
<td class="org-right">22</td>
</tr>


<tr>
<td class="org-left">Beta</td>
<td class="org-right">0</td>
<td class="org-right">62</td>
<td class="org-right">54</td>
<td class="org-right">20</td>
<td class="org-right">30</td>
<td class="org-right">29</td>
</tr>


<tr>
<td class="org-left">Beta</td>
<td class="org-right">20</td>
<td class="org-right">-</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">30</td>
<td class="org-right">&#xa0;</td>
</tr>
</tbody>
</table>

For a lower request rate, of 0.8:

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Trip Distribution</th>
<th scope="col" class="org-right">Min trip</th>
<th scope="col" class="org-right">Drivers</th>
<th scope="col" class="org-right">P3</th>
<th scope="col" class="org-right">P2</th>
<th scope="col" class="org-right">P1</th>
<th scope="col" class="org-right">(Wait time)</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left">Uniform</td>
<td class="org-right">0</td>
<td class="org-right">36</td>
<td class="org-right">50</td>
<td class="org-right">20</td>
<td class="org-right">30</td>
<td class="org-right">30</td>
</tr>


<tr>
<td class="org-left">Uniform</td>
<td class="org-right">20</td>
<td class="org-right">42</td>
<td class="org-right">55</td>
<td class="org-right">15</td>
<td class="org-right">30</td>
<td class="org-right">24</td>
</tr>


<tr>
<td class="org-left">Beta</td>
<td class="org-right">0</td>
<td class="org-right">62</td>
<td class="org-right">54</td>
<td class="org-right">20</td>
<td class="org-right">30</td>
<td class="org-right">29</td>
</tr>


<tr>
<td class="org-left">Beta</td>
<td class="org-right">20</td>
<td class="org-right">-</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">30</td>
<td class="org-right">&#xa0;</td>
</tr>
</tbody>
</table>

So: long trips and uniform distribution are needed for this level of capacity utilization. It&rsquo;s at the upper end of what is geometrically possible.

Also: for the uniform cases, the results are independent of request rate: it takes more drivers, but they end up at the same distribution. This is surprising to me.

For uniform distributions, longer trips require more drivers to reach the 30% P1 rate, but when they do so there is a higher capacity utilization and lower pick-up time. Also a lower wait time. This may be said better as: for uniform distributions, longer trips lead to higher P3 rates at a given number of drivers, higher P2 values (they have to drive further to get their next drive), and corresponding lower P1 values.

P3 percentages and number of drivers to support a steady state may both be measures of efficiency.


<a id="org3c29655"></a>

# Simulating Manhattan


<a id="orgf04332a"></a>

## Grid size (50\*50)

According to [William Helmreich](https://en.wikipedia.org/wiki/William_B._Helmreich), New York City has 120,000 blocks, and he should know because he walked them all over the course of four years, for a total of 6163 miles (about 10K kilometers).

The figure of 120,000 blocks is reported in [a 2013 New Yorker article](https://www.newyorker.com/books/page-turner/a-walker-in-the-city) on Helmreich.

Manhattan is much smaller: from a [Quora question](https://www.quora.com/Approximately-how-many-blocks-are-there-on-the-island-of-Manhattan): 220th street is the northernmost street, and some say it&rsquo;s about 250 blocks north to south. Another way to think about it is that Manhattan is about 13 miles with 20 blocks to the mile (1 block ~ 100 yards). At its widest point Manhattan is 2.3 miles, but it is much narrower in other places. Someone else says 2872 blocks.

One approach is area. Manhattan is 59.1 km<sup>2</sup> (call it 60), or 6\*10<sup>7</sup> m<sup>2</sup>. That&rsquo;s equivalent to 23 square miles (or 13 \* 1.75).

According to [Wikipedia](https://en.wikipedia.org/wiki/City_block): &ldquo;the standard block in Manhattan is about 264 by 900 feet (80 m × 274 m)&rdquo;, so call that 100 \* 250m = 2.5\*10<sup>4</sup> m<sup>2</sup>. 

Number of blocks = (6 \* 10<sup>7</sup>)/(2.5 \* 10<sup>4</sup>) ~ 2.5 \* 10<sup>3</sup>, which is the same as a 50\*50 grid.
