doc/background.md


<a id="orgd2798c1"></a>

## Traffic speed (1 block per minute)

In midtown Manhattan the average traffic speed is 4.7mph ([LA Times 2018](https://www.latimes.com/nation/la-na-new-york-traffic-manhattan-20180124-story.html#:~:text=The%20average%20speed%20of%20traffic%20in%20Midtown%20Manhattan%20is%204.7%20mph.,-New%20York%20thinks)). Overall the average is probably higher though.

A block is the equivalent of 160m on one side (100 \* 250 ~ 160 \* 160) and 1 mile is 1600 meters, so 1 mile is 10 blocks. That suggests average traffic speed is about 50 blocks (5 miles) per hour, which is close to one block per minute.

There are 1440 minutes in a day.


<a id="org063a9d5"></a>

## Trip request rates (250)

First look at overall volumes per day, using data collected by Todd Schneider from NYC TLC and others, and presented on [Todd W. Schneider&rsquo;s web site](https://toddwschneider.com/dashboards/nyc-taxi-ridehailing-uber-lyft-data/). Schneider provides the code [On GitHub](https://github.com/toddwschneider/nyc-taxi-data). These are all &ldquo;pre-pandemic&rdquo; figures, from 2019 or so, and they are for all NYC, not just for Manhattan.

-   Number of ride-hail rides per day ~ 750K. (Does not include taxis)
-   Number of Uber rides per day ~ 500K (2/3 of all ridehail rides)
-   Number of unique ride-hail vehicles per month ~ 80K, most of which drove for Uber (quite a lot do both Uber and Lyft)
-   Number of unique drivers per month is similar
-   Number of monthly trips per vehicle ~ 200 (mean of 7 per day)
-   Mean number of vehicles (or drivers) per day ~ 60K
-   Mean daily trips per active vehicle ~ 13. (so total trips per day ~ 60K \* 13 = 780K, which matches number of ride-hail rides per day.
-   Average days per month on the road ~ 19
-   Average hours per day per vehicle ~ 6.
-   Trips per vehicle per active hour ~ 2.
-   Minutes per trip ~ 20 (hence utilization rate of 2/3 by hour)
-   Trips-in-progress hours per day ~ 3.7
-   Shared trips per day ~ 100K (fell off dramatically from 150K in 2018 to 100K in 2019, from 25% of trips to 15%).
-   Shared trips per day: Uber went from 125K in 2018 to 50K in 2019; Lyft from 30K in 2018 to 50K in 2019.

From all these numbers, we can say about 750K rides per day is about 500 rides per minute for all of NYC.

If 60K vehicles drive on 2/3 of the days in a month, then there may be 40K on the roads any one day. If each drives for 6 hours, that&rsquo;s 1/4 of the available hours, so there is a mean of 10K vehicles on the road in NYC at any one time.

In 2017, Carol Atkinson-Palombo [concluded](https://trid.trb.org/view/1586848) that &ldquo;Having surged 40-fold, ridesourcing trips originating in the outer boroughs now constitute 56% of the overall market.&rdquo; The &ldquo;outer boroughs&rdquo; are all apart from Manhattan (that is, Brooklyn, Queens, The Bronx, and Staten Island). 

If this is true then using 50% we end up with, *on Manhattan* (computing from trip volume, 20 minutes per trip, and 2/3 utilization rate:

-   350K trips per day (= 250 trips per minute \* 1440 minutes per day)
-   About 2 trips per vehicle hour, so that&rsquo;s about 180K vehicle hours or about 10M vehicle minutes.
-   7K drivers on the road each minute \* 1.4K minutes / day gives 10M, so that&rsquo;s about 7K on the road at once.
-   Schaller (below) concludes 100K vehicle hours per day in Manhattan CBD so that&rsquo;s not too different, given different years and that the CBD is only part of Manhattan.


<a id="orga956020"></a>

## Number of drivers (7000)

In December 2017, Bruce Schaller [concluded](http://www.schallerconsult.com/rideservices/emptyseats.pdf) that 200K trips per day started or ended in the Manhattan Central Business District (CBD), and that there are about 100K vehicle hours per day. He also concludes that &ldquo;setting aside overnight hours, there were an average of 9100 taxis or TNCs in the CBD weekdays between 8 am and midnight in June 2017.

Another source ([ny.curbed.com](https://ny.curbed.com/2020/3/13/21178259/coronavirus-new-york-city-uber-lyft-transportation-drivers), pulling from the NYT) says the ride-hailing industry &ldquo;employs roughly 80,000 drivers in New York City&rdquo;. This maps well to Schneider above. If half drive in Manhattan, and 1/4 are on the roads at any one time, then that would be about 10K.

Another approach: 

    request rate * trip length = cars * busy fraction

so

    cars = request rate * trip length / busy fraction

    cars = 250 trips per minute * 20 minutes per trip / (2/3) = 7500 


<a id="org48a600c"></a>

# Dynamic pricing and matching


<a id="orgdea1b1f"></a>

## Simulations and theory 1

Yan et al [Dynamic Pricing and Matching in Ride-Hailing Platforms](https://papers.ssrn.com/sol3/papers.cfm?abstract_id=3258234). 

Steady-state conditions

If number of drivers = L, Number of open drivers (available) = O, and the number of trips per unit time is Y then

    L = O + \eta . Y + T . Y

where \\eta = en-route time and T = length of trip. This is something I&rsquo;ve derived earlier.

Apparently there is a result (Larson and Odoni 1981) that if open drivers are distributed uniformly in an n-dimensional space, with constant travel speed and a straight line between two points, then the expected en-route time is \\eta(O) and satisfies

    \eta(O) ~ O ^ (-1/n)

So for two-dimensional roads, the en-route time is proportional to one over the square root of the number of open drivers.

Uber data from San Francisco, with L = 30 per km<sup>2</sup> and T = 15 minutes, goes more linearly. Here is a summary

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">Open Drivers</th>
<th scope="col" class="org-right">ETA (minutes)</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-right">4</td>
<td class="org-right">3.8</td>
</tr>


<tr>
<td class="org-right">6</td>
<td class="org-right">3.2</td>
</tr>


<tr>
<td class="org-right">8</td>
<td class="org-right">2.6</td>
</tr>


<tr>
<td class="org-right">10</td>
<td class="org-right">2.2</td>
</tr>


<tr>
<td class="org-right">12</td>
<td class="org-right">2.0</td>
</tr>


<tr>
<td class="org-right">14</td>
<td class="org-right">1.8</td>
</tr>
</tbody>
</table>

Little&rsquo;s Law:  Y represents the long-run average trip throughput, which equals the long-run average number of busy drivers in the system (L − O) divided by the average time required for a driver to complete a trip. The latter is equal to the sum of en route time η(O) and trip duration T.

    Y = (L - O) / (\eta(O) + T)

\(O*\) maximizes Y.

Supply elasticity: 

    L = l(1 - \theta).p.Q/L  or L = l(1 - \theta).p.Y/L

where \\theta is the fraction of the price collected by the platform, Q is the trip throughput, and l is the number of drivers who will participate at earnings level e. That is, l(.) is the supply elasticity curve.


<a id="orgeddb5ac"></a>

## Simulations and theory II

Feng et al: [We are on the Way: Analysis of On-Demand Ride-Hailing Systems](https://papers.ssrn.com/sol3/papers.cfm?abstract_id=2960991)

Variables chosen:

-   R = road length (size)
-   d = average trip distance
-   \\rho = system utilization level (request rate??)
-   k = number of drivers

Little&rsquo;s Law says average waiting time is proportional to the number of passengers waiting. Effective utilization level is:

    \rho = \lambda . (1 - \theta_a) / (k * \mu)

-   \\theta<sub>a</sub> is the abandonment rate: I don&rsquo;t bother with this
-   \\lambda is request rate (Poisson process: average time is known but exact timing is random and uncorrelated)
-   \\mu is the service rate v/d (v = speed)
-   \\rho = \\lambda / (k \\mu) = (\\lambda d/k) is the utilization rate (traffic intensity)
