doc/background.md


<a id="org3546b75"></a>

## Simulations and theory III

Shapiro: [Density of Demand and the Benefit of Uber](http://www.shapiromh.com/uploads/8/6/4/0/8640674/mshapiro_jmp.pdf)

Page 13: A consumer has a choice of transportation options. Utility from choosing a ride hail trip is:

    U = \alpha . p + \beta . w + \gamma

where \\alpha is the relative value of time and money, \\beta is time sensitivity (w is wait time) and \\gamma is everything else.


<a id="org32bac5d"></a>

## Simulations and theory IV

Tam and Liu: [Demand and Consumer Surplus in the On-demand Economy: the Case of Ride Sharing](https://pdfs.semanticscholar.org/e36b/05d96b81340ad3c480e38e8df4e1e1f1eef3.pdf    )

p 13:

    U = -\alpha .p + \beta (t_outside - (t_w + t_d)) + \gamma

